app/controllers/admin_controller.rb

  def get_all_users
    @users = User.all
---
SELECT "users".* FROM "users"