app/controllers/sessions_controller.rb

  def create
      begin
        user = User.authenticate(params[:email], params[:password])
      rescue Exception => e
    end

    if user
      session[:user_id] = user.id if User.where(:id => user.id).exists?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "joe@schmoe.com"], ["LIMIT", 1]]